import Top from "../elements/Top"
import Block from "../elements/Block"
import data from "../data/data.json"
import React from "react"

export default function MainPage() {
    const [links, setLinks] = React.useState([])

    React.useEffect(() => {
        const linksArr = []
        linksArr.push(`/attractions/${Math.floor(Math.random() * 6)}`)
        linksArr.push(`/castles/${Math.floor(Math.random() * 6)}`)
        linksArr.push(`/parks/${Math.floor(Math.random() * 6)}`)
        linksArr.push(`/landscapes/${Math.floor(Math.random() * 6)}`)
        linksArr.push(`/churches/${Math.floor(Math.random() * 6)}`)
        setLinks(linksArr)
    }, [])

    return (
        <>
            <Top />
            <Block
                left=""
                link={links[0]}
                img={[
                    data.attractions[0].img,
                    data.attractions[1].img,
                    data.attractions[2].img,
                    data.attractions[3].img,
                    data.attractions[4].img,
                    data.attractions[5].img,
                    data.attractions[6].img,
                ]}
                h1="Історико-культурні пам&apos;ятки"
                text='Пам&apos;ятка культури — визначна споруда археологічний об&apos;єкт або витвір мистецтва що є частиною культурного надбання (культурної спадщини) країни, людства загалом (пам&apos;ятка історії, літератури,мистецтва, мови, права тощо) і охороняється законом. Залежно від наукової, історичної і художньої цінності пам&apos;ятки культури бувають світового, державного і  місцевого значення.'
            />
            <Block
                left="left"
                link={links[1]}
                img={[
                    data.castles[0].img,
                    data.castles[1].img,
                    data.castles[2].img,
                    data.castles[3].img,
                    data.castles[4].img,
                    data.castles[5].img,
                    data.castles[6].img,
                ]}
                h1="Замки"
                text="Замок — «укріплене житло феодала доби середньовіччя з оборонними, господарськими, культовими і т. ін. будівлями, звичайно оточене високим кам'яним муром з кількома вежами». У XVIII-XIX століттях замки втратили своє оборонно-військове призначення і перетворилися на палаци знаті та аристократії. Як правило, замок займав найвигідніше (з військової точки зору) положення на місцевості. До наших днів збереглася велика кількість замків, які визнані пам'ятками історії та культури. Південноруські замки XVI століття в своїй більшості були дерев'яними.[3] Деякі замки навіть переносили: наприклад, Вінницький замок, а Остерський навіть кілька разів — раз тому,що річка відійшла від замку, вдруге — бо почала сильно розмивати гору; пробували перенести Черкаський замок, але міське населення відмовило­ся переселятися, не вважаючи за безпечне віддалятися від Дніпра.[3] Від міста, яке зазвичай будували на певній відстані, замки відділяли глибоки­ми ровами, через які вели звідні мости.[3] Крім замків Луцька і Крем'янця, які мали кам'яні стіни, інші такі замки були деревяними: Київ­ський, Володимирський, Кременецький (розміри їх в описах не вказані), Канівський замок, найбіль­шими серед них з відомих були: Житомирський — 62x55 сажнів, Луцький — влас­не замок 54,5x48, а “пригородок”, чи окольний замок, — 75x128, Мозирський замок — 63x28, окольний замок 169 сажнів у периметрі; най­меншим був Чорнобильський — 22x17 сажнів."
            />
            <Block
                left=""
                link={links[2]}
                img={[
                    data.parks[0].img,
                    data.parks[1].img,
                    data.parks[2].img,
                    data.parks[3].img,
                    data.parks[4].img,
                    data.parks[5].img,
                    data.parks[6].img,
                ]}
                h1="Парки"
                text='Парк (фр. parc від лат. parricus − «обгорожене місце»)[1] — спеціальна обмежена природна або штучна територія, виділена переважно з метою рекреації, відпочинку. В побуті слова «парк» та «сад» далеко не розійшлися. Тому широко використовується словосполучення «садово-паркове мистецтво». Проте сад існує для постачання фруктів, тоді як парк може мати садову ділянку, а може не мати її.'
            />
            <Block
                left="left"
                link={links[3]}
                img={[
                    data.landscapes[0].img,
                    data.landscapes[1].img,
                    data.landscapes[2].img,
                    data.landscapes[3].img,
                    data.landscapes[4].img,
                    data.landscapes[5].img,
                    data.landscapes[6].img,
                ]}
                h1="Природні ландшафти"
                text="Приро́дний ландша́фт (від нім. Landschaft, вигляд простору, краєвид) — цілісна частина ландшафтної оболонки Землі, що утворилася в результаті складної й тривалої взаємодії основних геокомпонентів планети (гірських порід, води, повітря, біоти) в певних (щоразу специфічних) умовах середовища, і як наслідок - набула характерного вигляду в просторі. Відтак, якщо у загальному розумінні, ландшафт це будь-який простір з характерним виглядом, то у географічному - це простір з характерним виглядом у межах ландшафтної оболонки Землі. Ландшафти мають різні розміри: від невеликих локальних утворень (річкові заплави й тераси, ерозійні яри і балки, гляціальні долини і горби тощо), до геокомплексів регіонального (рівнинні й гірські простори, континенти й океани тощо) й глобального (ландшафтна оболонки Землі) рівня. Назви природних ландшафтів відбивають їх приналежність до теплових поясів, фізико-географічних зон, рівнин чи гір. За цими ознаками виділяють арктичні, тайгові, мішано-лісові, лісостепові, степові, пустельні, субтропічні, тропічні, екваторіальні, рівнинні та гірські ландшафти."
            />
            <Block
                left=""
                link={links[4]}
                img={[
                    data.churches[0].img,
                    data.churches[1].img,
                    data.churches[2].img,
                    data.churches[3].img,
                    data.churches[4].img,
                    data.churches[5].img,
                    data.churches[6].img,
                ]}
                h1="Церкви"
                text='Церква (грец. Ἐκκλησία, «зібрання вірних») — спільнота віруючих, мирян і священиків, одного віросповідання, як місцева так і спільнота всієї земної кулі.  Церква — християнська конфесія (Католицька церква, Православна церква, Лютеранська церква, Англіканська церква тощо).  Церква — релігійна громада християн у конкретній місцевості.  Церква — парафія, церковна громада.  Церква (грец. Κυριακη (οικια), «дім Господа») — храм, в якому відбувається християнське богослужіння'
            />
        </>
    )
}